cities = ['北京市', '天津市', '石家庄市', '太原市', '呼和浩特市', '保定市', '唐山市', '包头市', '邯郸市', '廊坊市', '沧州市', '张家口市', '沈阳市', '大连市', '长春市', '哈尔滨市', '鞍山市', '吉林市', '抚顺市', '营口市', '盘锦市',
          '通化市', '延边州', '牡丹江市','四平市', '丹东市', '佳木斯市', '齐齐哈尔市', '大庆市', '葫芦岛市', '上海市', '南京市', '杭州市', '苏州市', '无锡市', '青岛市', '福州市', '济南市', '厦门市', '宁波市', '南通市', '合肥市',
          '常州市', '昆山市', '扬州市', '嘉兴市', '泉州市', '烟台市', '南昌市', '芜湖市', '镇江市', '徐州市', '台州市', '淄博市', '临沂市', '金华市', '威海市', '阜阳市', '济宁市', '淮安市', '湖州市', '泰州市', '蚌埠市', '张家港市',
          '宿迁市', '温州市', '余姚市', '德州市', '潍坊市', '淮北市', '马鞍山市', '三明市', '宁德市', '日照市', '东营市', '赣州市', '福清市','莆田市', '亳州市', '绍兴市', '滁州市', '盐城市', '深圳市', '广州市', '武汉市', '珠海市',
          '长沙市', '郑州市', '佛山市', '东莞市', '中山市', '惠州市', '海口市', '江门市', '荆门市', '宜昌市', '南宁市', '洛阳市', '三亚市', '常德市', '清远市', '汕头市', '荆州市', '湘潭市', '桂林市', '湛江市', '南阳市', '株洲市',
          '周口市', '河源市', '许昌市', '潮州市', '安阳市', '梅州市', '信阳市', '驻马店市', '揭阳市', '成都市', '重庆市', '昆明市', '贵阳市', '绵阳市', '南充市', '内江市', '拉萨市', '泸州市', '普洱市', '日喀则地区', '资阳市',
          '丽江市', '西双版纳傣族自治州', '西安市', '乌鲁木齐市', '银川市', '西宁市', '兰州市', '渭南市', '嘉峪关市', '伊犁州', '宝鸡市', '酒泉市']
